In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('weather_data.csv' , parse_dates = True , index_col = 'day')

In [3]:
df

            temperature  windspeed  event
day
2017-01-01           32          6   Rain
2017-01-02           35          7  Sunny
2017-01-03           28          2   Snow
2017-01-04           24          7   Snow
2017-01-05           32          4   Rain
2017-01-06           31          2  Sunny

<h2>Indexing DFs</h2>

In [4]:
df['event']['2017-1-3']

'Snow'

In [5]:
df.event['2017-1-3']

'Snow'

In [6]:
df[['temperature' , 'event']]
#returns a df

            temperature  event
day
2017-01-01           32   Rain
2017-01-02           35  Sunny
2017-01-03           28   Snow
2017-01-04           24   Snow
2017-01-05           32   Rain
2017-01-06           31  Sunny

the efficient way is to use .loc() , .iloc()

In [7]:
df.loc['2017-1-3' , 'event']

'Snow'

in loc give index first and then col_name

In [8]:
df.loc['2017-1-5']

temperature      32
windspeed         4
event          Rain
Name: 2017-01-05 00:00:00, dtype: object

Pandas Series is like a **Hybrid between Numpy array & Dictionary**

In [9]:
df.loc['2017-1-5'][0:2]

temperature    32
windspeed       4
Name: 2017-01-05 00:00:00, dtype: object

In [10]:
df.loc[: , ['event' , 'temperature']]

            event  temperature
day
2017-01-01   Rain           32
2017-01-02  Sunny           35
2017-01-03   Snow           28
2017-01-04   Snow           24
2017-01-05   Rain           32
2017-01-06  Sunny           31

In [11]:
df.loc[: , 'temperature' : 'windspeed']

            temperature  windspeed
day
2017-01-01           32          6
2017-01-02           35          7
2017-01-03           28          2
2017-01-04           24          7
2017-01-05           32          4
2017-01-06           31          2

In [12]:
df.loc['2017' , 'temperature' ]

day
2017-01-01    32
2017-01-02    35
2017-01-03    28
2017-01-04    24
2017-01-05    32
2017-01-06    31
Name: temperature, dtype: int64

**Filtering DF**

In [13]:
df['temperature'] > 30

day
2017-01-01     True
2017-01-02     True
2017-01-03    False
2017-01-04    False
2017-01-05     True
2017-01-06     True
Name: temperature, dtype: bool

In [14]:
df[df['temperature'] > 30]

            temperature  windspeed  event
day
2017-01-01           32          6   Rain
2017-01-02           35          7  Sunny
2017-01-05           32          4   Rain
2017-01-06           31          2  Sunny

In [15]:
df[(df['temperature'] > 30) & (df['event'] == 'Rain') ]

            temperature  windspeed event
day
2017-01-01           32          6  Rain
2017-01-05           32          4  Rain

In [16]:
df[(df['temperature'] > 30) & (df['event'] > 'Rain') ]

            temperature  windspeed  event
day
2017-01-02           35          7  Sunny
2017-01-06           31          2  Sunny

Len(summer) is greater than len(Rain)

In [17]:
df[(df['temperature'] > 30) & (df['event'] < 'Rain') ]

Empty DataFrame
Columns: [temperature, windspeed, event]
Index: []

Nothing is printed , coz no event elements has len lesser than Rain

In [18]:
df2 = df.copy()

In [19]:
df2

            temperature  windspeed  event
day
2017-01-01           32          6   Rain
2017-01-02           35          7  Sunny
2017-01-03           28          2   Snow
2017-01-04           24          7   Snow
2017-01-05           32          4   Rain
2017-01-06           31          2  Sunny

In [20]:
df2['new_col'] = [0,1,2,3,4,5]

In [21]:
df2

            temperature  windspeed  event  new_col
day
2017-01-01           32          6   Rain        0
2017-01-02           35          7  Sunny        1
2017-01-03           28          2   Snow        2
2017-01-04           24          7   Snow        3
2017-01-05           32          4   Rain        4
2017-01-06           31          2  Sunny        5

In [22]:
df2.loc[ : , df2.all()]

            temperature  windspeed  event
day
2017-01-01           32          6   Rain
2017-01-02           35          7  Sunny
2017-01-03           28          2   Snow
2017-01-04           24          7   Snow
2017-01-05           32          4   Rain
2017-01-06           31          2  Sunny

Returns a all the columns of df if they dont have 0, if any one col element has a value 0 , that col is not added in the df returned

In [23]:
df2.iloc[4:6] = np.nan

In [24]:
df2

            temperature  windspeed  event  new_col
day
2017-01-01         32.0        6.0   Rain      0.0
2017-01-02         35.0        7.0  Sunny      1.0
2017-01-03         28.0        2.0   Snow      2.0
2017-01-04         24.0        7.0   Snow      3.0
2017-01-05          NaN        NaN    NaN      NaN
2017-01-06          NaN        NaN    NaN      NaN

In [25]:
df2.loc[ : , df2.all()]

            temperature  windspeed  event
day
2017-01-01         32.0        6.0   Rain
2017-01-02         35.0        7.0  Sunny
2017-01-03         28.0        2.0   Snow
2017-01-04         24.0        7.0   Snow
2017-01-05          NaN        NaN    NaN
2017-01-06          NaN        NaN    NaN

All columns are in df ,  coz **all() checks only for zeros, NaN values are not taken into consideration**

In [26]:
df2 = df.copy()

In [27]:
df2['new_col'] = [0,1,2,3,4,5]

In [28]:
df2

            temperature  windspeed  event  new_col
day
2017-01-01           32          6   Rain        0
2017-01-02           35          7  Sunny        1
2017-01-03           28          2   Snow        2
2017-01-04           24          7   Snow        3
2017-01-05           32          4   Rain        4
2017-01-06           31          2  Sunny        5

In [29]:
df2.loc[: , df2.any()]

            temperature  windspeed  event  new_col
day
2017-01-01           32          6   Rain        0
2017-01-02           35          7  Sunny        1
2017-01-03           28          2   Snow        2
2017-01-04           24          7   Snow        3
2017-01-05           32          4   Rain        4
2017-01-06           31          2  Sunny        5

All col is returned coz even if there's a zero in new_col . Coz **any() only removes the col if all the elements in the col is 0**

In [30]:
df2.loc[1:2 , 1:2] = np.nan

In [31]:
df2

            temperature  windspeed  event  new_col
day
2017-01-01           32        6.0   Rain        0
2017-01-02           35        NaN  Sunny        1
2017-01-03           28        2.0   Snow        2
2017-01-04           24        7.0   Snow        3
2017-01-05           32        4.0   Rain        4
2017-01-06           31        2.0  Sunny        5

In [32]:
df2.loc[: , df2.isnull().any()]

            windspeed
day
2017-01-01        6.0
2017-01-02        NaN
2017-01-03        2.0
2017-01-04        7.0
2017-01-05        4.0
2017-01-06        2.0

Returns the whole col even if **it has any one NaN value**

In [33]:
df2.loc[: , df2.notnull().all()]

            temperature  event  new_col
day
2017-01-01           32   Rain        0
2017-01-02           35  Sunny        1
2017-01-03           28   Snow        2
2017-01-04           24   Snow        3
2017-01-05           32   Rain        4
2017-01-06           31  Sunny        5

windspeed col is not added coz it had a one NaN value

In [34]:
df2.dropna(how = 'any')

            temperature  windspeed  event  new_col
day
2017-01-01           32        6.0   Rain        0
2017-01-03           28        2.0   Snow        2
2017-01-04           24        7.0   Snow        3
2017-01-05           32        4.0   Rain        4
2017-01-06           31        2.0  Sunny        5

That one row with a NaN column is deleted

In [35]:
df2 = df.copy()
df2.loc[1:2 , 1:2] = np.nan

In [36]:
df2

            temperature  windspeed  event
day
2017-01-01           32        6.0   Rain
2017-01-02           35        NaN  Sunny
2017-01-03           28        2.0   Snow
2017-01-04           24        7.0   Snow
2017-01-05           32        4.0   Rain
2017-01-06           31        2.0  Sunny

In [37]:
df2.dropna(how = 'all')

            temperature  windspeed  event
day
2017-01-01           32        6.0   Rain
2017-01-02           35        NaN  Sunny
2017-01-03           28        2.0   Snow
2017-01-04           24        7.0   Snow
2017-01-05           32        4.0   Rain
2017-01-06           31        2.0  Sunny

How = 'all' keeps the NaN parameter

<h2>Transforming DFs</h2>

**Convert to dozen units**

In [38]:
df2['temperature'].floordiv(12)

day
2017-01-01    2
2017-01-02    2
2017-01-03    2
2017-01-04    2
2017-01-05    2
2017-01-06    2
Name: temperature, dtype: int64

In [39]:
df2['temperature'].apply(lambda n : n*2)

day
2017-01-01    64
2017-01-02    70
2017-01-03    56
2017-01-04    48
2017-01-05    64
2017-01-06    62
Name: temperature, dtype: int64

In [40]:
df2['new_col'] = df2['temperature'].apply(lambda n : n*2)

In [41]:
df2

            temperature  windspeed  event  new_col
day
2017-01-01           32        6.0   Rain       64
2017-01-02           35        NaN  Sunny       70
2017-01-03           28        2.0   Snow       56
2017-01-04           24        7.0   Snow       48
2017-01-05           32        4.0   Rain       64
2017-01-06           31        2.0  Sunny       62

In [42]:
df2['event'].map(str.upper)

day
2017-01-01     RAIN
2017-01-02    SUNNY
2017-01-03     SNOW
2017-01-04     SNOW
2017-01-05     RAIN
2017-01-06    SUNNY
Name: event, dtype: object

In [43]:
df2['temperature'] + df2['windspeed']

day
2017-01-01    38.0
2017-01-02     NaN
2017-01-03    30.0
2017-01-04    31.0
2017-01-05    36.0
2017-01-06    33.0
dtype: float64

Any no + NaN = NaN

In [44]:
True + np.nan

nan

In [45]:
1 + np.nan

nan

<h2>Advanced Indexing</h2>

<ul>
    <b>Key building blocks of Pandas</b>
    <li> Indexes (Sequence of labels)</li>
    <li> Series (1D array with Index)</li>
    <li> DataFrames (2D array with series as Columns)</li>

**Pandas indexes are immutable (Like dict keys)**

In [46]:
df2.index

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06'],
              dtype='datetime64[ns]', name='day', freq=None)

In [47]:
df2.index[2]

Timestamp('2017-01-03 00:00:00')

In [48]:
#df2.index[2] = '2017-2-2'


#The above code will throw an error coz indexes in pandas are immutable

In [49]:
df2

            temperature  windspeed  event  new_col
day
2017-01-01           32        6.0   Rain       64
2017-01-02           35        NaN  Sunny       70
2017-01-03           28        2.0   Snow       56
2017-01-04           24        7.0   Snow       48
2017-01-05           32        4.0   Rain       64
2017-01-06           31        2.0  Sunny       62

In [50]:
df2.index = df2['temperature']

In [51]:
df2

             temperature  windspeed  event  new_col
temperature
32                    32        6.0   Rain       64
35                    35        NaN  Sunny       70
28                    28        2.0   Snow       56
24                    24        7.0   Snow       48
32                    32        4.0   Rain       64
31                    31        2.0  Sunny       62

In [52]:
del df2['temperature']

In [53]:
df2

             windspeed  event  new_col
temperature
32                 6.0   Rain       64
35                 NaN  Sunny       70
28                 2.0   Snow       56
24                 7.0   Snow       48
32                 4.0   Rain       64
31                 2.0  Sunny       62

<h2>Hierarchical Indexing</h2>

In [54]:
df = pd.read_csv('weather_data.csv')

In [55]:
df2 = df.copy()

In [56]:
df2

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [57]:
df2.set_index(['day' , 'temperature'] , inplace=True)

In [58]:
df2.index

MultiIndex(levels=[['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017', '1/5/2017', '1/6/2017'], [24, 28, 31, 32, 35]],
           codes=[[0, 1, 2, 3, 4, 5], [3, 4, 1, 0, 3, 2]],
           names=['day', 'temperature'])

In [59]:
df2

                      windspeed  event
day      temperature
1/1/2017 32                   6   Rain
1/2/2017 35                   7  Sunny
1/3/2017 28                   2   Snow
1/4/2017 24                   7   Snow
1/5/2017 32                   4   Rain
1/6/2017 31                   2  Sunny

In [60]:
df2.index.name

Prints Nothing coz this returns None , (Multi index df , so index.name returns None)

In [61]:
df2.index.names

FrozenList(['day', 'temperature'])

In [62]:
df2.sort_index(inplace=True)

In [63]:
df2

                      windspeed  event
day      temperature
1/1/2017 32                   6   Rain
1/2/2017 35                   7  Sunny
1/3/2017 28                   2   Snow
1/4/2017 24                   7   Snow
1/5/2017 32                   4   Rain
1/6/2017 31                   2  Sunny

In [64]:
df2.sort_values(by = 'windspeed')

                      windspeed  event
day      temperature
1/3/2017 28                   2   Snow
1/6/2017 31                   2  Sunny
1/5/2017 32                   4   Rain
1/1/2017 32                   6   Rain
1/2/2017 35                   7  Sunny
1/4/2017 24                   7   Snow

In [65]:
df2.loc['1/6/2017' , 31]

windspeed        2
event        Sunny
Name: (1/6/2017, 31), dtype: object

<h2>Pivoting DF</h2>

In [66]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [67]:
df.pivot(index = 'day' , values= 'temperature' , columns='event')

event     Rain  Snow  Sunny
day
1/1/2017  32.0   NaN    NaN
1/2/2017   NaN   NaN   35.0
1/3/2017   NaN  28.0    NaN
1/4/2017   NaN  24.0    NaN
1/5/2017  32.0   NaN    NaN
1/6/2017   NaN   NaN   31.0

**Unstacking**

In [68]:
df2

                      windspeed  event
day      temperature
1/1/2017 32                   6   Rain
1/2/2017 35                   7  Sunny
1/3/2017 28                   2   Snow
1/4/2017 24                   7   Snow
1/5/2017 32                   4   Rain
1/6/2017 31                   2  Sunny

In [69]:
df2.unstack(level = 'temperature')

            windspeed                     event
temperature        24   28   31   32   35    24    28     31    32     35
day
1/1/2017          NaN  NaN  NaN  6.0  NaN   NaN   NaN    NaN  Rain    NaN
1/2/2017          NaN  NaN  NaN  NaN  7.0   NaN   NaN    NaN   NaN  Sunny
1/3/2017          NaN  2.0  NaN  NaN  NaN   NaN  Snow    NaN   NaN    NaN
1/4/2017          7.0  NaN  NaN  NaN  NaN  Snow   NaN    NaN   NaN    NaN
1/5/2017          NaN  NaN  NaN  4.0  NaN   NaN   NaN    NaN  Rain    NaN
1/6/2017          NaN  NaN  2.0  NaN  NaN   NaN   NaN  Sunny   NaN    NaN

In [70]:
df2.unstack(level = 1)
#Both are same

            windspeed                     event
temperature        24   28   31   32   35    24    28     31    32     35
day
1/1/2017          NaN  NaN  NaN  6.0  NaN   NaN   NaN    NaN  Rain    NaN
1/2/2017          NaN  NaN  NaN  NaN  7.0   NaN   NaN    NaN   NaN  Sunny
1/3/2017          NaN  2.0  NaN  NaN  NaN   NaN  Snow    NaN   NaN    NaN
1/4/2017          7.0  NaN  NaN  NaN  NaN  Snow   NaN    NaN   NaN    NaN
1/5/2017          NaN  NaN  NaN  4.0  NaN   NaN   NaN    NaN  Rain    NaN
1/6/2017          NaN  NaN  2.0  NaN  NaN   NaN   NaN  Sunny   NaN    NaN

In [71]:
df2.unstack(level = 0)

            windspeed                                                 event  \
day          1/1/2017 1/2/2017 1/3/2017 1/4/2017 1/5/2017 1/6/2017 1/1/2017
temperature
24                NaN      NaN      NaN      7.0      NaN      NaN      NaN
28                NaN      NaN      2.0      NaN      NaN      NaN      NaN
31                NaN      NaN      NaN      NaN      NaN      2.0      NaN
32                6.0      NaN      NaN      NaN      4.0      NaN     Rain
35                NaN      7.0      NaN      NaN      NaN      NaN      NaN


day         1/2/2017 1/3/2017 1/4/2017 1/5/2017 1/6/2017
temperature
24               NaN      NaN     Snow      NaN      NaN
28               NaN     Snow      NaN      NaN      NaN
31               NaN      NaN      NaN      NaN    Sunny
32               NaN      NaN      NaN     Rain      NaN
35             Sunny      NaN      NaN      NaN      NaN

In [72]:
df2 = df2.unstack(level = 1)

In [73]:
df2

            windspeed                     event
temperature        24   28   31   32   35    24    28     31    32     35
day
1/1/2017          NaN  NaN  NaN  6.0  NaN   NaN   NaN    NaN  Rain    NaN
1/2/2017          NaN  NaN  NaN  NaN  7.0   NaN   NaN    NaN   NaN  Sunny
1/3/2017          NaN  2.0  NaN  NaN  NaN   NaN  Snow    NaN   NaN    NaN
1/4/2017          7.0  NaN  NaN  NaN  NaN  Snow   NaN    NaN   NaN    NaN
1/5/2017          NaN  NaN  NaN  4.0  NaN   NaN   NaN    NaN  Rain    NaN
1/6/2017          NaN  NaN  2.0  NaN  NaN   NaN   NaN  Sunny   NaN    NaN

In [74]:
df2 = df2.stack(level = 1)

In [75]:
df2

                      windspeed  event
day      temperature
1/1/2017 32                 6.0   Rain
1/2/2017 35                 7.0  Sunny
1/3/2017 28                 2.0   Snow
1/4/2017 24                 7.0   Snow
1/5/2017 32                 4.0   Rain
1/6/2017 31                 2.0  Sunny

In [76]:
df2.swaplevel(0 , 1)

                      windspeed  event
temperature day
32          1/1/2017        6.0   Rain
35          1/2/2017        7.0  Sunny
28          1/3/2017        2.0   Snow
24          1/4/2017        7.0   Snow
32          1/5/2017        4.0   Rain
31          1/6/2017        2.0  Sunny

<h3>Melting DFs</h3>

In [77]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [78]:
#After pivoting
pivoted_df = df.pivot(index = 'day' , values= 'temperature' , columns='event')

In [79]:
pivoted_df

event     Rain  Snow  Sunny
day
1/1/2017  32.0   NaN    NaN
1/2/2017   NaN   NaN   35.0
1/3/2017   NaN  28.0    NaN
1/4/2017   NaN  24.0    NaN
1/5/2017  32.0   NaN    NaN
1/6/2017   NaN   NaN   31.0

In [80]:
pd.melt(pivoted_df)

    event  value
0    Rain   32.0
1    Rain    NaN
2    Rain    NaN
3    Rain    NaN
4    Rain   32.0
5    Rain    NaN
6    Snow    NaN
7    Snow    NaN
8    Snow   28.0
9    Snow   24.0
10   Snow    NaN
11   Snow    NaN
12  Sunny    NaN
13  Sunny   35.0
14  Sunny    NaN
15  Sunny    NaN
16  Sunny    NaN
17  Sunny   31.0

In [81]:
pd.melt(pivoted_df , id_vars='day' , value_vars=['Rain','Snow','Sunny'])

/home/karthikeyan/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

    day  event  value
0   NaN   Rain   32.0
1   NaN   Rain    NaN
2   NaN   Rain    NaN
3   NaN   Rain    NaN
4   NaN   Rain   32.0
5   NaN   Rain    NaN
6   NaN   Snow    NaN
7   NaN   Snow    NaN
8   NaN   Snow   28.0
9   NaN   Snow   24.0
10  NaN   Snow    NaN
11  NaN   Snow    NaN
12  NaN  Sunny    NaN
13  NaN  Sunny   35.0
14  NaN  Sunny    NaN
15  NaN  Sunny    NaN
16  NaN  Sunny    NaN
17  NaN  Sunny   31.0

**Pivot requires unique index / column pairsto identify values in the new table.**
<p> So we use Pivot Table </p>

In [82]:
df.pivot_table(index = 'day' , columns = 'event' , values = ['temperature' , 'windspeed'])

         temperature             windspeed
event           Rain  Snow Sunny      Rain Snow Sunny
day
1/1/2017        32.0   NaN   NaN       6.0  NaN   NaN
1/2/2017         NaN   NaN  35.0       NaN  NaN   7.0
1/3/2017         NaN  28.0   NaN       NaN  2.0   NaN
1/4/2017         NaN  24.0   NaN       NaN  7.0   NaN
1/5/2017        32.0   NaN   NaN       4.0  NaN   NaN
1/6/2017         NaN   NaN  31.0       NaN  NaN   2.0

<h2>Grouping Data</h2>

In [83]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

**Instead of boolean filtering we can use groupby()**

In [84]:
df.loc[df['event'] == 'Sunny'].count()

day            2
temperature    2
windspeed      2
event          2
dtype: int64

In [85]:
df.groupby('event').count()

       day  temperature  windspeed
event
Rain     2            2          2
Snow     2            2          2
Sunny    2            2          2

In [86]:
df.index = range(6,12)

In [87]:
df.index.name = 'Number'

In [88]:
df

             day  temperature  windspeed  event
Number
6       1/1/2017           32          6   Rain
7       1/2/2017           35          7  Sunny
8       1/3/2017           28          2   Snow
9       1/4/2017           24          7   Snow
10      1/5/2017           32          4   Rain
11      1/6/2017           31          2  Sunny

In [89]:
df.groupby('Number')['event'].sum()

Number
6      Rain
7     Sunny
8      Snow
9      Snow
10     Rain
11    Sunny
Name: event, dtype: object

In [90]:
df.groupby(['event' , 'temperature']).mean()\

                   windspeed
event temperature
Rain  32                   5
Snow  24                   7
      28                   2
Sunny 31                   2
      35                   7

In [91]:
df['event'].unique()

array(['Rain', 'Sunny', 'Snow'], dtype=object)

In [92]:
df.event = df.event.astype('category')

In [93]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 6 to 11
Data columns (total 4 columns):
day            6 non-null object
temperature    6 non-null int64
windspeed      6 non-null int64
event          6 non-null category
dtypes: category(1), int64(2), object(1)
memory usage: 338.0+ bytes

**Adv. Of categorical memory**
<ul>
<li>Less memory</li>
<li>Speeds up the operation like 'GroupBy'</li>
    </ul>

**Aggregation**

**Single aggregation**

In [94]:
df.groupby('event').agg(['max'])

            day temperature windspeed
            max         max       max
event
Rain   1/5/2017          32         6
Snow   1/4/2017          28         7
Sunny  1/6/2017          35         7

**Multiple Aggregation**

In [95]:
df.groupby('event').agg(['max' , 'sum'])

            day                   temperature     windspeed
            max               sum         max sum       max sum
event
Rain   1/5/2017  1/1/20171/5/2017          32  64         6  10
Snow   1/4/2017  1/3/20171/4/2017          28  52         7   9
Sunny  1/6/2017  1/2/20171/6/2017          35  66         7   9

We can also give user defined functions in agg , but that has to be not in single/double quotes

In [96]:
df.groupby('event').agg({'temperature' : 'sum' , 
                        'windspeed' : 'count'})

       temperature  windspeed
event
Rain            64          2
Snow            52          2
Sunny           66          2

In [97]:
df.groupby('event')

In [98]:
df.groupby('event').groups

{'Rain': Int64Index([6, 10], dtype='int64', name='Number'),
 'Snow': Int64Index([8, 9], dtype='int64', name='Number'),
 'Sunny': Int64Index([7, 11], dtype='int64', name='Number')}

In [99]:
type(df.groupby('event').groups)

dict

In [100]:
df.groupby('event').groups.keys()

dict_keys(['Rain', 'Snow', 'Sunny'])

**Boolean Groupby**

In [101]:
rainy = df['event'].str.contains('Rain')

In [102]:
rainy

Number
6      True
7     False
8     False
9     False
10     True
11    False
Name: event, dtype: bool

In [103]:
df.groupby(['temperature' , rainy]).mean()

                   windspeed
temperature event
24          False          7
28          False          2
31          False          2
32          True           5
35          False          7

In [104]:
df = pd.DataFrame({"A":[4, 5, 2, 6],  
                   "B":[11, 2, 5, 8], 
                   "C":[1, 8, 66, 4]})

In [105]:
df

   A   B   C
0  4  11   1
1  5   2   8
2  2   5  66
3  6   8   4

In [106]:
df.idxmin()

A    2
B    1
C    0
dtype: int64

In [107]:
df.idxmin(axis = 1)

0    C
1    B
2    A
3    C
dtype: object

In [108]:
df.idxmax()

A    3
B    0
C    2
dtype: int64

In [109]:
df.idxmax(axis = 1)

0    B
1    C
2    C
3    B
dtype: object

to plot we can make **multi index by one index by unstack()**

In [110]:
df.transform(lambda x : x *20)

     A    B     C
0   80  220    20
1  100   40   160
2   40  100  1320
3  120  160    80

In [111]:
s = pd.Series(range(3))

In [112]:
s

0    0
1    1
2    2
dtype: int64

In [113]:
s.transform(np.sqrt)

0    0.000000
1    1.000000
2    1.414214
dtype: float64

In [114]:
type(s.transform(np.sqrt))

pandas.core.series.Series

In [115]:
s.transform([np.sqrt , np.exp])

       sqrt       exp
0  0.000000  1.000000
1  1.000000  2.718282
2  1.414214  7.389056

In [116]:
type(s.transform([np.sqrt , np.exp]))

pandas.core.frame.DataFrame